res/cf/Catalogs/Серверы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Серверы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hostname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Catalogs/Серверы/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Отказ = HostnameСуществует();
	Наименование = ?(ПустаяСтрока(Наименование), Hostname, Наименование);
	IP = ?(ПустаяСтрока(IP), Справочники.Серверы.ВыполнитьNSLOOKUP(Hostname).IP, IP);
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция HostnameСуществует()
	
	Запрос = ЗапросыВызовСервера;
	
	ОписаниеЗапроса = Запрос.ПолучитьОписаниеЗапроса();
	ОписаниеУсловия = Запрос.ПолучитьОписаниеУсловия();
	
	ОписаниеЗапроса.Элемент = Ссылка;
	ОписаниеЗапроса.Реквизиты.Добавить("Ссылка");
	
	ОписаниеУсловия.ЛевоеЗначение = "Ссылка";
	ОписаниеУсловия.ПравоеЗначение = Ссылка;
	ОписаниеУсловия.НеСодержит = Истина;
	ОписаниеЗапроса.Условие.Добавить(ОписаниеУсловия);
	
	ОписаниеУсловия.ЛевоеЗначение = "Hostname";
	ОписаниеУсловия.ПравоеЗначение = Hostname;
	ОписаниеУсловия.НеСодержит = Ложь;
	ОписаниеЗапроса.Условие.Добавить(ОписаниеУсловия);
	
	РезультатЗапроса = Запрос.ПолучитьДанныеОбъектаПоСсылкеНаЭлемент(ОписаниеЗапроса);
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
